---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.PartGuid
source: html/131fdb1b-9aae-517d-1cc0-cb8c625a72f4.htm
---
# Autodesk.Revit.DB.FabricationPart.PartGuid Property

The fabrication part's globally unique identifier.

## Syntax (C#)
```csharp
public Guid PartGuid { get; }
```